app/controllers/contact_controller.rb

  def message
  	if params[:name].present? && params[:email].present? && params[:message].present?
  		newMessage = Message.new( name: params[:name], mail: params[:email], message: params[:message])
  		if newMessage.save
---
INSERT INTO `messages` (`name`, `mail`, `message`, `created_at`, `updated_at`) VALUES ('Quy Hoang Ngoc', 'quyhn@hiworld.com.vn', 'xxxxxxx', '2016-01-25 09:29:35', '2016-01-25 09:29:35')