app/controllers/offices_controller.rb

SELECT `offices`.* FROM `offices`
---
	def index
		@offices = Office.all

SELECT  `offices`.* FROM `offices` WHERE `offices`.`id` = 1 LIMIT 1
UPDATE `offices` SET `like` = 1, `image` = 'v1453040748/rrq89csslqr8kuj1bvis.png', `updated_at` = '2016-01-17 14:27:47' WHERE `offices`.`id` = 1
---
	def like
		if params[:idPost].present?
			likeCount = Office.find(params[:idPost])
			likeCount.like = likeCount.like + 1
			likeCount.save

INSERT INTO `contacts` (`name`, `email`, `created_at`, `updated_at`) VALUES ('xxxx', 'xxx', '2016-01-21 01:32:12', '2016-01-21 01:32:12')
SELECT `contacts`.* FROM `contacts`
---
	def sendmail
		@newContact = Contact.new( name: params[:name], email: params[:email])
		# ERROR
		clearDataField = []
		# save form
		if @newContact.save
			render json:{notice: "Success !"}
		else
			# short messages
			errorMessage = []
			focusElement = ""
			# push name error message
			if @newContact.errors["name"][0].present?

INSERT INTO `offices` (`title`, `owner`, `image`, `like`, `dislike`, `slug`, `created_at`, `updated_at`) VALUES ('con mều', 'ádasdsad', 'ádasdasdas', 10, 0, 'con-m-u-by-adasdsad', '2016-01-17 07:40:47', '2016-01-17 07:40:47')
---
	def create
		# must have role
		# add params if don't have owner
		imageParams = office_params
		if imageParams[:owner] == ""
			imageParams[:owner] = "Admin congso.club"
		end
		@office = Office.new(imageParams)
		respond_to do |format|
			if @office.save

SELECT  `offices`.* FROM `offices` WHERE `offices`.`id` = 1 LIMIT 1
---
		def set_office
			@office = Office.friendly.find(params[:id])