app/controllers/offices_controller.rb

	def show
		productDomain = "localhost:3000"
		@currentUrl = "https://" + productDomain + "/offices/" + @office.slug
		# add to database
		post = Office.find(@office.id)
---
SELECT  `offices`.* FROM `offices` WHERE `offices`.`slug` = 'con-m-u-by-adasdsad'  ORDER BY `offices`.`id` ASC LIMIT 1